[
    {
        "Certification": "GSEC",
        "Full name": ": GIAC Security Essentials Certification (GSEC)",
        "Exam Number": "GSEC (GIAC uses the certification code as the exam identifier; no separate numeric exam number)",
        "Last Updated": "GIAC posts the exact “Last Updated” date on the official GSEC page and revises it periodically; as of 2025, GSEC is active and current. Please verify the current revision date on GIAC’s site.",
        "summary": "The GIAC Security Essentials (GSEC) certification validates a professionalï¿½s knowledge of information security concepts, best practices, and hands-on skills necessary to secure systems and networks.",
        "detail description": "GSEC is a certification offered by the Global Information Assurance Certification (GIAC), focusing on foundational security skills. It covers topics such as network security, cryptography, incident response, and security policies. It is designed for security professionals who want to demonstrate their practical understanding of security principles and their ability to implement security measures.",
        "who": "IT professionals, security analysts, network administrators, and cybersecurity practitioners seeking to establish or validate their foundational security knowledge and skills.",
        "why": "Obtaining GSEC demonstrates a solid understanding of core security concepts, enhances credibility, and can serve as a stepping stone for advanced security certifications. It also helps organizations identify qualified personnel capable of managing security tasks effectively.",
        "requirements": "There are no formal prerequisites for the GSEC exam, but candidates should have a basic understanding of networking, operating systems, and security concepts.",
        "cost": "Approximately $1,899 USD (price may vary based on location and testing provider).",
        "exam details": "Passing score: Typically around 70-75% (exact passing score is not publicly disclosed)     Number of questions: 180 questions (multiple choice, scenario-based, and interactive questions)     Time limit: 5 hours     Testing provider: Pearson VUE     Registration portal: [GIAC Certification Portal](https://www.giac.org/certification/security-essentials-gsec)",
        "vendor site": "[GIAC Security Essentials (GSEC)](https://www.giac.org/certification/security-essentials-gsec)",
        "vendor": "GIAC Security and Audit Certification (GIAC)"
    },
    {
        "Certification": "CCISO",
        "Full name": ": EC-Council Certified Chief Information Security Officer (C|CISO)",
        "Exam Number": "712-50",
        "Last Updated": "Current version v3; last published exam blueprint update in 2021 (v3 originally released in 2019)",
        "summary": "The Certified Chief Information Security Officer (CCISO) is a certification designed for senior information security executives, focusing on leadership, management, and strategic aspects of information security.",
        "detail description": "The CCISO certification, offered by the EC-Council (International Council of E-Commerce Consultants), aims to bridge the gap between technical security knowledge and executive management skills. It emphasizes governance, risk management, policy development, and strategic planning, preparing professionals to lead security programs at the organizational level.",
        "who": "Senior security professionals, Chief Information Security Officers, security directors, and executives responsible for information security governance and strategy.",
        "why": "It validates high-level security management expertise, enhances leadership credibility, and demonstrates the ability to align security initiatives with organizational goals, making it ideal for those aiming to advance into executive roles.",
        "requirements": "Minimum of five years of cumulative work experience in information security management, including experience in policy, governance, and leadership roles. No formal prerequisites, but professional experience is strongly recommended.",
        "cost": "Approximately $999 USD",
        "exam details": "Passing score: 70%   Number of questions: 150 multiple-choice questions   Time limit: 2.5 hours (150 minutes)   Testing provider: Pearson VUE   Registration portal: [https://cert.eccouncil.org/cciso](https://cert.eccouncil.org/cciso)",
        "vendor site": "[https://www.eccouncil.org/train-certify/certified-chief-information-security-officer-cciso-north-america/](https://www.eccouncil.org/train-certify/certified-chief-information-security-officer-cciso-north-america/)",
        "vendor": "EC-Council (International Council of E-Commerce Consultants)"
    },
    {
        "Certification": "CASP+ CE",
        "Exam Number": "CAS-004",
        "Last Updated": "CAS-004 released October 6, 2021 (current as of October 2024)",
        "summary": "The CompTIA Advanced Security Practitioner (CASP+) Certification Exam (CASP+ CE) validates advanced skills in enterprise security, risk management, and enterprise security architecture.",
        "detail description": "CASP+ CE is a vendor-neutral certification designed for experienced cybersecurity professionals. It emphasizes practical, hands-on skills in enterprise security, including risk management, enterprise security architecture, research and collaboration, and integration of computing, communications, and business disciplines.",
        "who": "Experienced cybersecurity practitioners, security engineers, and security analysts seeking to demonstrate advanced knowledge in enterprise security architecture and risk management.",
        "why": "It enhances credibility and career prospects by validating advanced security skills, and is recognized globally by employers for senior security roles.",
        "requirements": "Recommended: At least 10 years of experience in IT administration, with at least 5 years in hands-on technical security roles. No formal prerequisites, but knowledge of security architecture and enterprise security is essential.",
        "cost": "$480 USD",
        "exam details": "Passing score: 750 (on a scale of 100-900)   Number of questions: 80   Time limit: 165 minutes   Testing provider: Pearson VUE   Registration portal: [CompTIA CASP+ CE Exam Registration](https://www.comptia.org/certifications/casp)",
        "vendor site": "[CompTIA CASP+ Certification](https://www.comptia.org/certifications/casp)",
        "vendor": "CompTIA (Computing Technology Industry Association)"
    },
    {
        "Certification": "CCSP",
        "Full name": ": Certified Cloud Security Professional (CCSP)",
        "Exam Number": "No numeric exam number; Pearson VUE exam ID: CCSP",
        "Last Updated": "August 1, 2022",
        "summary": "The Certified Cloud Security Professional (CCSP) is an advanced certification designed to validate expertise in cloud security architecture, design, operations, and service orchestration.",
        "detail description": "The CCSP is jointly offered by (ISC)ï¿½ (International Information System Security Certification Consortium) and Cloud Security Alliance. It emphasizes best practices, policies, and procedures for securing cloud environments, including data security, compliance, architecture, and operations. The certification is recognized globally and aligns with industry standards for cloud security management.",
        "who": "IT and information security professionals involved in cloud security architecture, design, operations, and management, including security consultants, auditors, architects, and managers.",
        "why": "To demonstrate expertise in securing cloud environments, improve career prospects, and validate knowledge of cloud security best practices aligned with industry standards and regulations.",
        "requirements": "At least five years of cumulative paid work experience in information technology, of which three years must be in information security, and one year in cloud security.   Alternatively, holding the (ISC)ï¿½ Certified Information Systems Security Professional (CISSP) certification can waive the experience requirement.",
        "cost": "$599",
        "exam details": "Passing score: 700 out of 1000 points   Number of questions: 125 multiple-choice and advanced innovative questions   Time limit: 4 hours   Testing provider: Pearson VUE   Registration portal: [https://www.isc2.org/Certifications/CCSP](https://www.isc2.org/Certifications/CCSP)",
        "vendor site": "[https://www.isc2.org/certifications/CCSP](https://www.isc2.org/certifications/CCSP)",
        "vendor": "International Information System Security Certification Consortium (ISC)²"
    },
    {
        "Certification": "CHFI",
        "Full name": ": EC-Council Computer Hacking Forensic Investigator (CHFI)",
        "Exam Number": "312-49 (CHFI v10)",
        "Last Updated": "v10 released in 2021",
        "summary": "The Computer Hacking Forensic Investigator (CHFI) certification validates expertise in digital forensics, including the ability to identify, gather, and analyze digital evidence to support cybercrime investigations.",
        "detail description": "The CHFI certification, offered by EC-Council (International Council of E-Commerce Consultants), focuses on the skills required to conduct comprehensive digital investigations. It covers areas such as computer crime scene investigation, evidence collection, analysis, and reporting, as well as understanding various forensic tools and techniques.",
        "who": "Cybersecurity professionals, digital forensic investigators, incident response team members, law enforcement personnel, and IT security consultants involved in digital investigations.",
        "why": "Obtaining the CHFI demonstrates proficiency in digital forensics, enhances credibility in cybercrime investigations, and improves career prospects in cybersecurity and forensic analysis.",
        "requirements": "No formal prerequisites are mandated, but candidates should have a basic understanding of computer networks, operating systems, and cybersecurity fundamentals.",
        "cost": "Approximately $100 USD (varies by region and testing center).",
        "exam details": "Passing score: 70%   Number of questions: 150 multiple-choice questions   Time limit: 4 hours   Testing provider: Pearson VUE   Registration portal: [https://cert.eccouncil.org](https://cert.eccouncil.org)",
        "vendor site": "[https://www.eccouncil.org/programs/computer-hacking-forensic-investigator-chi/](https://www.eccouncil.org/programs/computer-hacking-forensic-investigator-chi/)",
        "vendor": "EC-Council (International Council of E-Commerce Consultants)"
    },
    {
        "Certification": "GSNA",
        "Full name": ": GIAC Systems and Network Auditor",
        "Exam Number": "No formal exam number; GIAC exam code: GSNA",
        "Last Updated": "Not publicly disclosed by GIAC (refer to the official GSNA page for the current “Exam Objectives last updated” date)",
        "summary": "The GIAC Security Essentials (GSEC) certification validates a practitioner's knowledge of information security concepts, including network security, cryptography, and security policies.",
        "detail description": "The GSEC is an entryto intermediate-level certification offered by the Global Information Assurance Certification (GIAC). It covers a broad range of security topics such as network security, cryptography, incident handling, and security policies, emphasizing practical skills for security professionals.",
        "who": "IT security practitioners, network administrators, security analysts, and anyone involved in implementing or managing security measures within an organization.",
        "why": "It demonstrates foundational security knowledge, enhances credibility, and can serve as a stepping stone to more advanced certifications in cybersecurity.",
        "requirements": "No formal prerequisites are required, but familiarity with networking, operating systems, and basic security concepts is recommended.",
        "cost": "$1,699 (as of October 2023)",
        "exam details": "Passing score: Not publicly specified, but typically around 70%     Number of questions: 115 questions (multiple choice and scenario-based)     Time limit: 4 hours     Testing provider: Pearson VUE     Registration portal: [GIAC Certification Portal](https://www.giac.org/certification/security-essentials-gsec/)",
        "vendor site": "[GIAC Security Essentials (GSEC)](https://www.giac.org/certification/security-essentials-gsec/)",
        "vendor": "GIAC Security and Audit Certification (GIAC)"
    },
    {
        "Certification": "CFR",
        "Full name": ": CyberSec First Responder (CFR)",
        "Exam Number": "CFR-410 (current)",
        "Last Updated": "Current revision CFR-410 released in 2021 (launched November 2021)",
        "summary": "The Certified Forensic Reporter (CFR) is a certification focused on digital forensic reporting, emphasizing skills in documenting, analyzing, and presenting digital forensic findings.",
        "detail description": "The CFR certification validates expertise in creating clear, comprehensive forensic reports that communicate digital evidence findings effectively. It covers best practices in forensic documentation, report writing, and courtroom testimony, ensuring professionals can present digital evidence in a legally sound and understandable manner.",
        "who": "Digital forensic investigators, forensic analysts, law enforcement officers, legal professionals involved in digital evidence, and cybersecurity practitioners involved in forensic reporting.",
        "why": "Obtaining the CFR demonstrates proficiency in forensic reporting, enhances credibility in legal proceedings, and improves communication of complex digital evidence to non-technical audiences, including judges and juries.",
        "requirements": "No formal prerequisites are mandated, but practical experience in digital forensics and report writing is recommended.",
        "cost": "Approximately $300 USD",
        "exam details": "Passing score: Typically 70-75% (varies by testing provider)   Number of questions: 100 multiple-choice questions   Time limit: 2 hours   Testing provider: Pearson VUE   Registration portal: [https://www.pearsonvue.com](https://www.pearsonvue.com) (search for CFR exam)",
        "vendor site": "[https://www.cfrtraining.com](https://www.cfrtraining.com)",
        "vendor": "CertNexus"
    },
    {
        "Certification": "CCNA Cyber Ops",
        "Full name": ": Cisco Certified CyberOps Associate (replaces the retired CCNA Cyber Ops)",
        "Exam Number": "200-201 CBROPS",
        "Last Updated": "Current version v1.0 introduced Feb 24, 2020; still current (no newer revision announced as of 2025)",
        "summary": "The Cisco Certified CyberOps Associate (CCNA CyberOps) certification validates foundational knowledge and skills required for associate-level cybersecurity roles, focusing on security monitoring, incident response, and security operations center (SOC) tasks.",
        "detail description": "The CCNA CyberOps certification prepares professionals to work within a Security Operations Center (SOC), monitoring security alerts, analyzing security incidents, and understanding cybersecurity principles. It covers topics such as cybersecurity fundamentals, security monitoring, host-based analysis, network intrusion analysis, and incident response procedures.",
        "who": "IT professionals, security analysts, network administrators, and cybersecurity enthusiasts seeking entry-level roles in security operations, incident response, or security monitoring.",
        "why": "It provides a solid foundation in cybersecurity operations, enhances employability in security roles, and aligns with industry demand for cybersecurity skills, especially in SOC environments.",
        "requirements": "No formal prerequisites are required, but a basic understanding of networking and security concepts is recommended.",
        "cost": "Approximately $300 USD.",
        "exam details": "Passing score: Not publicly specified (scaled scoring).   Number of questions: Approximately 100-110 questions.   Time limit: 120 minutes.   Testing provider: Pearson VUE.   Registration portal: [Cisco Certification Portal](https://www.cisco.com/c/en/us/training-events/training-certifications/certifications.html)",
        "vendor site": "[https://www.cisco.com/c/en/us/training-events/training-certifications/certifications.html](https://www.cisco.com/c/en/us/training-events/training-certifications/certifications.html)",
        "vendor": "Cisco Systems"
    },
    {
        "Certification": "SSCP",
        "Full name": ": ISC2 Systems Security Certified Practitioner (SSCP)",
        "Exam Number": "No official exam number; listed as “SSCP” at Pearson VUE",
        "Last Updated": "November 1, 2024 (latest exam outline/content update)",
        "summary": "The Systems Security Certified Practitioner (SSCP) is an entryto mid-level cybersecurity certification offered by (ISC)ï¿½ that validates technical skills in implementing, monitoring, and administering information security practices.",
        "detail description": "The SSCP certifies professionals who possess practical knowledge of security operations, risk identification, incident response, and network security. It emphasizes hands-on skills necessary to protect organizational assets and supports career advancement in cybersecurity roles.",
        "who": "IT and cybersecurity professionals such as security analysts, administrators, engineers, and those involved in security operations who want to demonstrate their technical expertise and foundational security knowledge.",
        "why": "Obtaining the SSCP enhances credibility, demonstrates technical proficiency, and can lead to career growth opportunities in cybersecurity. It also serves as a stepping stone toward advanced certifications like (ISC)ï¿½ Certified Information Systems Security Professional (CISSP).",
        "requirements": "One year of cumulative paid work experience in one or more of the seven domains of the SSCP Common Body of Knowledge (CBK). No formal education is mandatory, but relevant experience is required.",
        "cost": "$150 USD",
        "exam details": "Passing score: 700 out of 1000 points   Number of questions: 125 multiple-choice questions   Time limit: 3 hours   Testing provider: Pearson VUE   Registration portal: [https://www.isc2.org/Certifications/SSCP](https://www.isc2.org/Certifications/SSCP)",
        "vendor site": "[https://www.isc2.org/Certifications/SSCP](https://www.isc2.org/Certifications/SSCP)",
        "vendor": "International Information System Security Certification Consortium (ISC)²"
    },
    {
        "Certification": "CISM",
        "Full name": ": Certified Information Security Manager (CISM)",
        "Exam Number": "number; listed by ISACA simply as the “CISM” exam",
        "Last Updated": "Exam content outline/job practice last updated in June 2022 (effective June 2022)",
        "summary": "Certified Information Security Manager (CISM) is a globally recognized certification focused on information security management, governance, and risk management.",
        "detail description": "CISM is offered by ISACA (Information Systems Audit and Control Association) and emphasizes managing and governing enterprise information security programs. It validates expertise in designing, establishing, and maintaining an information security program aligned with organizational goals.",
        "who": "Information security managers, security consultants, risk managers, and IT professionals responsible for managing enterprise security programs.",
        "why": "It demonstrates advanced knowledge in information security management, enhances career prospects, and is often a requirement for senior security leadership roles.",
        "requirements": "At least five years of professional work experience in information security management, with a minimum of three years in security management in at least three of the domains covered by the exam. One year of experience can be waived with a relevant four-year degree or an approved credential.",
        "cost": "$575 for ISACA members; $760 for non-members.",
        "exam details": "Passing score: 450 out of 800   Number of questions: 150 multiple-choice questions   Time limit: 4 hours   Testing provider: Pearson VUE   Registration portal: [ISACA CISM Registration](https://www.isaca.org/credentialing/cism)",
        "vendor site": "[ISACA CISM Certification](https://www.isaca.org/credentialing/cism)",
        "vendor": "Information Systems Audit and Control Association (ISACA)"
    },
    {
        "Certification": "CSSLP",
        "Full name": ": Certified Secure Software Lifecycle Professional (CSSLP)",
        "Exam Number": "No numeric exam code; listed as “CSSLP” with Pearson VUE",
        "Last Updated": "September 15, 2023 (latest exam outline/domain update)",
        "summary": "Certified Secure Software Lifecycle Professional (CSSLP) is a certification focused on securing the software development lifecycle, emphasizing best practices for developing secure software.",
        "detail description": "The CSSLP, offered by (ISC)ï¿½ (International Information System Security Certification Consortium), validates expertise in incorporating security practices throughout the software development lifecycle. It covers areas such as secure software requirements, design, implementation, testing, and deployment, ensuring professionals can develop and maintain secure applications.",
        "who": "Software developers, security engineers, application architects, DevOps professionals, and software security specialists involved in designing, developing, or maintaining secure software systems.",
        "why": "To demonstrate expertise in integrating security into every phase of software development, reduce vulnerabilities, and align with industry best practices. It enhances credibility and career prospects in secure software development.",
        "requirements": "Minimum of four years of cumulative paid work experience in at least one of the (ISC)ï¿½ CSSLP Common Body of Knowledge (CBK) domains.   A four-year college degree or an approved credential can waive one year of experience.   No specific prerequisites for the exam itself.",
        "cost": "$599 (may vary by region or promotional discounts).",
        "exam details": "Passing score: 700 out of 1000 points   Number of questions: 125 multiple-choice questions   Time limit: 3 hours   Testing provider: Pearson VUE   Registration portal: [https://www.isc2.org/Certifications/CSSLP](https://www.isc2.org/Certifications/CSSLP)",
        "vendor site": "[https://www.isc2.org/Certifications/CSSLP](https://www.isc2.org/Certifications/CSSLP)",
        "vendor": "International Information System Security Certification Consortium (ISC)²"
    },
    {
        "Certification": "GCIA",
        "Full name": ": GIAC Certified Intrusion Analyst",
        "Exam Number": "GCIA (single proctored exam)",
        "Last Updated": "Not publicly disclosed by GIAC; certification is active and current as of October 2025",
        "summary": "The GIAC Certified Intrusion Analyst (GCIA) is a certification focused on network intrusion detection, analysis, and response, validating expertise in monitoring and analyzing network traffic for security threats.",
        "detail description": "The GCIA certification, offered by the Global Information Assurance Certification (GIAC), certifies professionals in the skills necessary to detect and analyze network intrusions using various tools and techniques. It emphasizes understanding network protocols, traffic analysis, intrusion detection systems, and incident response procedures.",
        "who": "Network security analysts, intrusion detection system (IDS) administrators, security engineers, and incident responders involved in monitoring and analyzing network traffic.",
        "why": "Obtaining the GCIA demonstrates advanced knowledge in intrusion detection and network security, enhancing career prospects, credibility, and ability to respond effectively to security incidents.",
        "requirements": "No formal prerequisites, but prior experience with network security, intrusion detection systems, and traffic analysis is recommended.",
        "cost": "Approximately $1,499 USD",
        "exam details": "Passing score: Not publicly disclosed; typically around 70-75%     Number of questions: 100-150 (varies)     Time limit: 3 hours     Testing provider: Pearson VUE     Registration portal: [GIAC Certification Portal](https://www.giac.org/certification/certifications)",
        "vendor site": "[GIAC Certifications](https://www.giac.org/certifications)",
        "vendor": "Global Information Assurance Certification (GIAC)"
    },
    {
        "Certification": "GCIH",
        "Full name": ": GIAC Certified Incident Handler (GCIH)",
        "Exam Number": "No formal exam number; certification code is GCIH",
        "Last Updated": "Not publicly disclosed by GIAC; GCIH is active and current as of October 2024",
        "summary": "The GIAC Certified Incident Handler (GCIH) is a certification focused on detecting, responding to, and resolving computer security incidents, emphasizing incident handling and computer crime investigation.",
        "detail description": "The GCIH certification, offered by the Global Information Assurance Certification (GIAC), validates a professionalï¿½s ability to identify and respond to security incidents, understand attacker techniques, and implement effective mitigation strategies. It covers topics such as intrusion detection, incident response, malware analysis, and hacker techniques.",
        "who": "Security professionals, incident responders, system administrators, network administrators, and cybersecurity analysts involved in incident handling and response.",
        "why": "It demonstrates expertise in managing security incidents, understanding attacker methodologies, and implementing effective response strategies, which are critical skills in cybersecurity defense.",
        "requirements": "No formal prerequisites, but experience in cybersecurity, network security, or incident response is recommended.",
        "cost": "Approximately $1,899 USD.",
        "exam details": "Passing score: Approximately 70% (scaled score)   Number of questions: 75 multiple-choice and scenario-based questions   Time limit: 3 hours   Testing provider: Pearson VUE   Registration portal: [https://www.giac.org/certification/certifications/incident-handlers-gcih/](https://www.giac.org/certification/certifications/incident-handlers-gcih/)",
        "vendor site": "[https://www.giac.org/certification/certifications/incident-handlers-gcih/](https://www.giac.org/certification/certifications/incident-handlers-gcih/)",
        "vendor": "Global Information Assurance Certification (GIAC)"
    },
    {
        "Certification": "CISSP-ISSAP",
        "Full name": ": ISSAP – Information Systems Security Architecture Professional (CISSP Concentration)",
        "Exam Number": "CISSP-ISSAP (no numeric exam code; ISC2 uses the ISSAP concentration code)",
        "Last Updated": "November 2020 (latest published exam outline update as of 2024)",
        "summary": "The Certified Information Systems Security Professional Information Systems Security Architecture Professional (CISSP-ISSAP) is an advanced certification focusing on designing and building security solutions and architectures.",
        "detail description": "CISSP-ISSAP is a concentration exam under (ISC)ï¿½'s CISSP certification, targeting security professionals with expertise in security architecture. It emphasizes designing security solutions, understanding security architecture frameworks, and integrating security into enterprise architecture.",
        "who": "Security architects, security consultants, security managers, and senior security professionals involved in designing and implementing security architectures.",
        "why": "It validates advanced knowledge and skills in security architecture, enhancing credibility and career prospects in senior security roles.",
        "requirements": "Candidates must hold the CISSP (Certified Information Systems Security Professional) certification and have at least two years of cumulative, paid work experience in at least two of the six CISSP-ISSAP domains.",
        "cost": "$599 (exam fee; additional costs may apply for training or study materials).",
        "exam details": "Passing score: 700 out of 1000 points   Number of questions: 125 multiple-choice and scenario-based questions   Time limit: 3 hours   Testing provider: Pearson VUE   Registration portal: [https://www.isc2.org/Certifications/ISSAP](https://www.isc2.org/Certifications/ISSAP)",
        "vendor site": "[https://www.isc2.org/Certifications/ISSAP](https://www.isc2.org/Certifications/ISSAP)",
        "vendor": "International Information System Security Certification Consortium (ISC)²"
    },
    {
        "Certification": "GCFA",
        "Full name": ": GIAC Certified Forensic Analyst",
        "Exam Number": "No separate exam number; single GIAC GCFA exam",
        "Last Updated": "2024 (GIAC lists the GCFA exam objectives as updated in 2024; objectives are maintained on an ongoing basis)",
        "summary": "The GIAC Certified Forensic Analyst (GCFA) is a certification focused on advanced digital forensics and incident response, emphasizing the analysis of computer and network breaches.",
        "detail description": "The GCFA certifies professionals' expertise in conducting advanced forensic investigations, analyzing malicious activity, and responding to security incidents. It covers topics such as memory analysis, network forensics, malware analysis, and incident handling, ensuring candidates can handle complex security breaches and provide actionable intelligence.",
        "who": "Cybersecurity professionals, incident responders, digital forensic analysts, and security consultants involved in incident response and forensic investigations.",
        "why": "Obtaining the GCFA demonstrates advanced skills in forensic analysis and incident response, increasing credibility and career opportunities in cybersecurity, especially in roles requiring deep technical expertise in breach investigations.",
        "requirements": "No formal prerequisites, but prior experience in cybersecurity, incident response, or digital forensics is recommended. Familiarity with Linux, Windows, and network protocols is beneficial.",
        "cost": "Approximately $1,499 USD",
        "exam details": "Passing score: Typically around 70% (scaled score)   Number of questions: 75-100 (varies)   Time limit: 4 hours   Testing provider: Pearson VUE   Registration portal: [https://www.giac.org/certification/certified-forensic-analyst-gcfa/](https://www.giac.org/certification/certified-forensic-analyst-gcfa/)",
        "vendor site": "[https://www.giac.org/certification/certified-forensic-analyst-gcfa/](https://www.giac.org/certification/certified-forensic-analyst-gcfa/)",
        "vendor": "GIAC (Global Information Assurance Certification)"
    },
    {
        "Certification": "GSLC",
        "Full name": ": GIAC Security Leadership Certification",
        "Exam Number": "GSLC (GIAC uses the certification code; no separate exam number)",
        "Last Updated": "Not publicly disclosed by GIAC; refer to the official GSLC page for the current exam objectives and updates",
        "summary": "The GIAC Security Leadership Certification (GSLC) is designed for security professionals aiming to demonstrate leadership and advanced knowledge in cybersecurity management, governance, and incident response.",
        "detail description": "The GSLC certifies individuals capable of managing security teams, developing security policies, and overseeing incident response processes. It emphasizes leadership skills, strategic planning, and understanding of security frameworks, risk management, and compliance.",
        "who": "Security managers, team leaders, security consultants, and professionals aspiring to leadership roles in cybersecurity.",
        "why": "It validates advanced security management skills, enhances credibility, and prepares professionals for strategic decision-making and leadership in cybersecurity environments.",
        "requirements": "No formal prerequisites, but practical experience in cybersecurity and security management is recommended.",
        "cost": "Approximately $1,699 USD.",
        "exam details": "Passing score: Not publicly specified; typically around 70-80%   Number of questions: 100   Time limit: 4 hours   Testing provider: GIAC (Global Information Assurance Certification) via ProctorU or authorized testing centers   Registration portal: [https://www.giac.org/certification/certifications/security-leadership-gslc/](https://www.giac.org/certification/certifications/security-leadership-gslc/)",
        "vendor site": "[https://www.giac.org/certification/certifications/security-leadership-gslc/](https://www.giac.org/certification/certifications/security-leadership-gslc/)",
        "vendor": "Global Information Assurance Certification (GIAC)"
    },
    {
        "Certification": "Network+ CE",
        "Full name": ": CompTIA Network+ (CE)",
        "Exam Number": "N10-009",
        "Last Updated": "June 2024",
        "summary": "The CompTIA Network+ Certification Exam (Network+ CE) validates foundational knowledge and skills in networking concepts, infrastructure, operations, security, and troubleshooting.",
        "detail description": "The Network+ CE certifies that an individual has the essential knowledge to install, configure, manage, and troubleshoot common wired and wireless networks. It covers network architecture, protocols, security, and troubleshooting techniques, making it a key credential for networking professionals.",
        "who": "IT professionals, network administrators, network technicians, and security personnel seeking foundational networking skills or starting a career in networking.",
        "why": "It demonstrates a solid understanding of networking concepts, enhances employability, and serves as a stepping stone for advanced certifications like Cisco's CCNA or Certified Information Systems Security Professional (CISSP).",
        "requirements": "There are no formal prerequisites; however, foundational knowledge of IT concepts is recommended. It is suitable for those with 9-12 months of networking experience.",
        "cost": "$338 (may vary by testing region and updates)",
        "exam details": "Passing score: 720 on a scale of 100-900   Number of questions: 90 (multiple choice and performance-based)   Time limit: 90 minutes   Testing provider: Pearson VUE   Registration portal: [CompTIA Network+ Certification](https://www.comptia.org/certifications/network)",
        "vendor site": "[CompTIA Network+ Certification](https://www.comptia.org/certifications/network)",
        "vendor": "CompTIA (Computing Technology Industry Association)"
    },
    {
        "Certification": "CND",
        "Full name": ": EC-Council Certified Network Defender (CND)",
        "Exam Number": "312-38 (ECC EXAM / Pearson VUE)",
        "Last Updated": "Updated to CND v3 in 2023 (current as of 2024)",
        "summary": "Certified Network Defense (CND) is a certification focused on network security, intrusion detection, and defense strategies to protect organizational networks from cyber threats.",
        "detail description": "The Certified Network Defense (CND) certification, offered by the EC-Council (International Council of Electronic Commerce Consultants), validates an individual's ability to implement and manage network security measures, including intrusion detection, incident response, and vulnerability assessment. It emphasizes understanding network attack techniques and deploying defense mechanisms to safeguard information assets.",
        "who": "IT security professionals, network administrators, security analysts, and cybersecurity practitioners responsible for defending organizational networks.",
        "why": "Obtaining the CND certification demonstrates expertise in network security defense, enhances career prospects, and equips professionals with practical skills to identify, prevent, and respond to network threats effectively.",
        "requirements": "There are no formal prerequisites; however, familiarity with networking concepts, TCP/IP protocols, and basic security principles is recommended.",
        "cost": "Approximately $100ï¿½$400, depending on the testing region and provider.",
        "exam details": "Passing score: 70%     Number of questions: 100ï¿½150 (varies)     Time limit: 2ï¿½3 hours     Testing provider: Pearson VUE and EC-Councilï¿½s testing centers     Registration portal: [EC-Council Certification Portal](https://cert.eccouncil.org)",
        "vendor site": "[EC-Council CND Certification](https://www.eccouncil.org/programs/certified-network-defense-cnd/)",
        "vendor": "EC-Council (International Council of E-Commerce Consultants)"
    },
    {
        "Certification": "CISSP",
        "Full name": "",
        "Exam Number": "",
        "Last Updated": "",
        "summary": "The Certified Information Systems Security Professional (CISSP) is a globally recognized certification for information security professionals, validating expertise in designing, implementing, and managing cybersecurity programs.",
        "detail description": "CISSP, offered by (ISC)ï¿½ (International Information System Security Certification Consortium), covers a broad range of security topics including security and risk management, asset security, security architecture and engineering, communication and network security, identity and access management, security assessment and testing, security operations, and software development security. It is considered a gold standard for security leadership roles.",
        "who": "Information security managers, security consultants, security analysts, security architects, and IT professionals seeking to demonstrate advanced knowledge and leadership in cybersecurity.",
        "why": "CISSP enhances credibility, demonstrates comprehensive security expertise, and can lead to higher salary prospects and career advancement opportunities in cybersecurity leadership roles.",
        "requirements": "Minimum of five years of cumulative paid work experience in two or more of the eight CISSP domains. A four-year college degree or an approved credential can substitute for one year of experience.",
        "cost": "$749 (subject to change; check official site for current pricing)",
        "exam details": "Passing score: 700 out of 1000 points   Number of questions: 100-150 (adaptive testing format)   Time limit: 3 hours   Testing provider: Pearson VUE   Registration portal: [https://www.isc2.org/Certifications/CISSP](https://www.isc2.org/Certifications/CISSP)",
        "vendor site": "[https://www.isc2.org/Certifications/CISSP](https://www.isc2.org/Certifications/CISSP)",
        "vendor": "International Information System Security Certification Consortium (ISC)²"
    },
    {
        "Certification": "HCISPP",
        "Full name": ": (ISC)² HealthCare Information Security and Privacy Practitioner (HCISPP)",
        "Exam Number": "No formal exam number; delivered via Pearson VUE under the code “HCISPP”",
        "Last Updated": "Exam outline last updated effective October 1, 2019 (latest published by (ISC)²)",
        "summary": "The HealthCare Information Security and Privacy Practitioner (HCISPP) certification validates expertise in managing healthcare information security and privacy risks, aligning with healthcare-specific regulations and standards.",
        "detail description": "The HCISPP is offered by (ISC)ï¿½ and focuses on the unique security and privacy challenges within the healthcare industry. It covers topics such as healthcare regulations (e.g., HIPAA), privacy principles, security controls, risk management, and incident response tailored to healthcare environments.",
        "who": "Healthcare security and privacy professionals, including information security officers, privacy officers, compliance officers, and healthcare IT staff responsible for safeguarding protected health information (PHI).",
        "why": "It demonstrates specialized knowledge in healthcare security and privacy, enhances credibility, and helps organizations comply with healthcare regulations, reducing the risk of data breaches and penalties.",
        "requirements": "Candidates must have at least two years of cumulative paid work experience in healthcare information security, privacy, or related fields. No formal education is required, but industry experience is recommended.",
        "cost": "$599",
        "exam details": "Passing score: 700 out of 1000   Number of questions: 125 multiple-choice questions   Time limit: 3 hours   Testing provider: Pearson VUE   Registration portal: [https://www.isc2.org/Certifications/HCISPP](https://www.isc2.org/Certifications/HCISPP)",
        "vendor site": "[https://www.isc2.org/Certifications/HCISPP](https://www.isc2.org/Certifications/HCISPP)",
        "vendor": "International Information System Security Certification Consortium (ISC)²"
    },
    {
        "Certification": "CISA",
        "Full name": ": Certified Information Systems Auditor (CISA)",
        "Exam Number": "No exam number/code; single ISACA CISA exam",
        "Last Updated": "CISA Exam Content Outline (Job Practice) last updated on 1 June 2019 (current as of 2025)",
        "summary": "Certified Information Systems Auditor (CISA) is a globally recognized certification for information systems auditing, control, and security professionals.",
        "detail description": "CISA certifies expertise in auditing, controlling, monitoring, and assessing an organizationï¿½s information technology and business systems. It emphasizes knowledge of audit process, governance, risk management, and security controls.",
        "who": "IT auditors, audit managers, security managers, risk management professionals, compliance officers, and IT consultants involved in auditing or assessing information systems.",
        "why": "To validate their skills and knowledge in information systems auditing and control, enhance career prospects, and demonstrate compliance with industry standards.",
        "requirements": "At least five years of professional experience in information systems auditing, control, or security. Up to three years of experience can be waived with certain educational qualifications.",
        "cost": "$575 (as of 2023; prices may vary by region)",
        "exam details": "Passing score: 450 out of 800   Number of questions: 150 multiple-choice questions   Time limit: 4 hours   Testing provider: Pearson VUE   Registration portal: [https://www.isaca.org/credentialing/cisa](https://www.isaca.org/credentialing/cisa)",
        "vendor site": "[https://www.isaca.org/certification/cisa](https://www.isaca.org/certification/cisa)",
        "vendor": "Information Systems Audit and Control Association (ISACA)"
    },
    {
        "Certification": "Cloud+",
        "Full name": ": CompTIA Cloud+",
        "Exam Number": "CV0-004",
        "Last Updated": "2024",
        "summary": "The CompTIA Cloud+ certification validates the skills required to implement and manage cloud technologies, ensuring professionals can securely deploy and optimize cloud infrastructure.",
        "detail description": "CompTIA Cloud+ is a vendor-neutral certification that covers cloud architecture, security, deployment, management, and troubleshooting. It emphasizes best practices for maintaining cloud environments, integrating multi-cloud solutions, and ensuring compliance and security.",
        "who": "IT professionals involved in cloud infrastructure, system administrators, network engineers, cloud administrators, and security professionals seeking to validate their cloud management skills.",
        "why": "It demonstrates expertise in cloud computing beyond basic knowledge, enhances career prospects, and aligns with industry standards for managing cloud environments securely and efficiently.",
        "requirements": "No formal prerequisites are required, but it is recommended that candidates have CompTIA Network+ and Security+ certifications or equivalent experience in networking, security, and virtualization.",
        "cost": "$338",
        "exam details": "Passing score: 750 (on a scale of 100-900)   Number of questions: 90   Time limit: 90 minutes   Testing provider: Pearson VUE   Registration portal: [CompTIA Cloud+ Exam Registration](https://home.pearsonvue.com/comptia)",
        "vendor site": "[CompTIA Cloud+ Certification](https://www.comptia.org/certifications/cloud)",
        "vendor": "CompTIA (Computing Technology Industry Association)"
    },
    {
        "Certification": "Security+ CE",
        "Full name": ": CompTIA Security+ (CE)",
        "Exam Number": "SY0-701",
        "Last Updated": "2023-11-07 (release of SY0-701)",
        "summary": "The CompTIA Security+ Certified Ethical Hacker (CEH) is a certification that validates skills in identifying vulnerabilities and weaknesses in computer systems and networks, emphasizing ethical hacking techniques and cybersecurity best practices.",
        "detail description": "The Security+ CEH certification focuses on penetration testing, vulnerability assessment, and ethical hacking methodologies. It covers topics such as reconnaissance, footprinting, scanning, enumeration, gaining access, maintaining access, and covering tracks, along with security management and compliance.",
        "who": "IT security professionals, network administrators, cybersecurity analysts, and ethical hackers seeking to demonstrate their expertise in penetration testing and vulnerability management.",
        "why": "It enhances credibility in cybersecurity roles, improves understanding of attack techniques, and helps organizations identify and mitigate security vulnerabilities proactively.",
        "requirements": "While there are no strict prerequisites, it is recommended that candidates have at least two years of experience in IT with a focus on security, and familiarity with networking concepts.",
        "cost": "Approximately $950 USD",
        "exam details": "Passing score: 70%   Number of questions: 125 multiple-choice and performance-based questions   Time limit: 4 hours   Testing provider: Pearson VUE   Registration portal: [https://home.pearsonvue.com/comptia](https://home.pearsonvue.com/comptia)",
        "vendor site": "[https://www.comptia.org/certifications/security](https://www.comptia.org/certifications/security)",
        "vendor": "CompTIA (Computing Technology Industry Association)"
    },
    {
        "Certification": "CySA+",
        "Full name": ": CompTIA Cybersecurity Analyst (CySA+)",
        "Exam Number": "CS0-003 (current)",
        "Last Updated": "June 2023 (CS0-003 release)",
        "summary": "The Cybersecurity Analyst+ (CySA+) certification, offered by CompTIA, validates skills in applying behavioral analytics to improve the overall security posture by identifying and combating malware, security threats, and vulnerabilities.",
        "detail description": "CySA+ focuses on security analytics, intrusion detection, and response. It emphasizes continuous security monitoring, threat detection, and incident response, utilizing tools like SIEM (Security Information and Event Management). The certification is designed to ensure professionals can analyze security data and implement appropriate security measures.",
        "who": "Security analysts, cybersecurity engineers, threat analysts, vulnerability analysts, and incident responders seeking to demonstrate their ability to proactively defend organizational networks.",
        "why": "It enhances credibility and demonstrates expertise in security analytics, threat detection, and incident response, which are critical skills in modern cybersecurity operations.",
        "requirements": "Recommended: CompTIA Security+ certification and 3-4 years of hands-on experience in information security. No formal prerequisites are mandatory, but experience is highly recommended.",
        "cost": "$392 USD",
        "exam details": "Passing score: 750 (on a scale of 100-900)   Number of questions: 85 (multiple choice and performance-based)   Time limit: 165 minutes   Testing provider: Pearson VUE   Registration portal: [CompTIA CySA+ Exam Registration](https://www.comptia.org/certifications/cybersecurity-analyst)",
        "vendor site": "[CompTIA CySA+ Certification](https://www.comptia.org/certifications/cybersecurity-analyst)",
        "vendor": "CompTIA (Computing Technology Industry Association)"
    },
    {
        "Certification": "CISSP-ISSEP",
        "Full name": ": (ISC)² CISSP-ISSEP – Information Systems Security Engineering Professional (CISSP concentration)",
        "Exam Number": "No numeric exam code; delivered as CISSP-ISSEP via Pearson VUE",
        "Last Updated": "Exam outline last revised/effective 15 November 2020",
        "summary": "The Certified Information Systems Security Professional Information Systems Security Engineering Professional (CISSP-ISSEP) is a specialized certification focused on applying security engineering principles and practices to secure information systems, aligning with the Department of Defense (DoD) and other government standards.",
        "detail description": "The CISSP-Information Systems Security Engineering Professional (ISSEP) is an advanced certification offered by (ISC)ï¿½ (International Information System Security Certification Consortium). It emphasizes security engineering, risk management, and system development life cycle security. The certification validates expertise in designing, integrating, and managing security solutions within complex systems, ensuring compliance with standards such as NIST (National Institute of Standards and Technology) and DoD directives.",
        "who": "Security professionals, systems engineers, security architects, and cybersecurity managers involved in the design, development, and implementation of secure systems, especially those working in government or defense sectors.",
        "why": "It demonstrates advanced knowledge and skills in security engineering, enhances credibility, and qualifies professionals for roles requiring expertise in secure system development and integration, particularly in regulated or high-security environments.",
        "requirements": "Candidates must hold the (ISC)ï¿½ CISSP (Certified Information Systems Security Professional) certification and have at least two years of cumulative, paid work experience in at least two of the eight CISSP-ISSEP domains.",
        "cost": "Approximately $699 USD.",
        "exam details": "Passing score: 700 out of 1000 points   Number of questions: 125 multiple-choice and advanced innovative questions   Time limit: 3 hours   Testing provider: Pearson VUE   Registration portal: [https://www.isc2.org/Certifications/ISSEP](https://www.isc2.org/Certifications/ISSEP)",
        "vendor site": "[https://www.isc2.org/Certifications/ISSEP](https://www.isc2.org/Certifications/ISSEP)",
        "vendor": "International Information System Security Certification Consortium (ISC)²"
    },
    {
        "Certification": "GCED",
        "Full name": ": GIAC Certified Enterprise Defender (GCED)",
        "Exam Number": "No formal exam number; certification/exam code is GCED (single proctored exam)",
        "Last Updated": "2024 (GIAC lists the GCED exam objectives as updated in 2024; exact date is provided on the GIAC GCED objectives page)",
        "summary": "The GIAC Certified Enterprise Defender (GCED) is a cybersecurity certification focused on advanced enterprise security defense, incident response, and threat management.",
        "detail description": "The GCED certification validates expertise in defending enterprise networks, analyzing security threats, and implementing effective security controls. It covers topics such as network security, incident handling, threat intelligence, and security architecture. It is designed for security professionals responsible for enterprise security operations and incident response.",
        "who": "Security analysts, incident responders, security engineers, and cybersecurity professionals involved in enterprise security defense and incident management.",
        "why": "Obtaining the GCED demonstrates advanced knowledge and skills in defending enterprise environments against sophisticated cyber threats, enhancing career prospects and credibility in cybersecurity roles.",
        "requirements": "No formal prerequisites are required, but candidates should have at least two years of experience in information security or related fields. Familiarity with security concepts, network protocols, and incident response is recommended.",
        "cost": "Approximately $1,699 USD.",
        "exam details": "Passing score: Not publicly disclosed (typically around 70%)   Number of questions: 100-150 (varies)   Time limit: 4 hours   Testing provider: GIAC (Global Information Assurance Certification) via Pearson VUE or ProctorU   Registration portal: [https://www.giac.org/certification/certified-enterprise-defender-gced/](https://www.giac.org/certification/certified-enterprise-defender-gced/)",
        "vendor site": "[https://www.giac.org/](https://www.giac.org/)",
        "vendor": "GIAC Security and Audit Certification (GIAC)"
    },
    {
        "Certification": "CCNP Security",
        "Full name": ": Cisco Certified Network Professional Security (CCNP Security)",
        "Exam Number": "Core exam: 350-701 SCOR; Concentration exam (choose one): 300-710 SNCF, 300-715 SISE, 300-720 SESA, 300-725 SWSA, 300-730 SVPN, 300-735 SAUTO",
        "Last Updated": "February 24, 2020 (current CCNP portfolio structure; certification remains active; individual exam blueprints receive periodic minor updates)",
        "summary": "The Cisco Certified Network Professional (CCNP) Security certification validates advanced skills in securing network infrastructures, implementing security solutions, and managing security policies within enterprise environments.",
        "detail description": "CCNP Security is a professional-level certification offered by Cisco that focuses on designing, implementing, and troubleshooting security solutions using Cisco security products and technologies. It covers topics such as VPNs, firewalls, intrusion prevention, and network access control. The certification demonstrates the ability to secure network infrastructures and respond to security threats effectively.",
        "who": "Network security engineers, security administrators, network engineers, and IT professionals involved in securing enterprise networks.",
        "why": "Achieving CCNP Security enhances credibility and demonstrates expertise in network security, opening opportunities for advanced roles and career growth in cybersecurity and network security management.",
        "requirements": "Candidates should have a good understanding of networking fundamentals and Cisco networking technologies. Cisco recommends having the Cisco Certified Network Associate (CCNA) Routing and Switching certification or equivalent knowledge and experience.",
        "cost": "Approximately $400 USD per exam.",
        "exam details": "Passing score: Not publicly specified (Cisco uses a scaled scoring system)     Number of questions: 90-110 questions     Time limit: 120 minutes     Testing provider: Pearson VUE     Registration portal: [Cisco Certification Portal](https://www.cisco.com/c/en/us/training-events/training-certifications/certifications.html)",
        "vendor site": "[https://www.cisco.com/c/en/us/training-events/training-certifications/certifications.html](https://www.cisco.com/c/en/us/training-events/training-certifications/certifications.html)",
        "vendor": "Cisco Systems"
    },
    {
        "Certification": "PenTest+",
        "Full name": ": CompTIA PenTest+",
        "Exam Number": "PT0-002",
        "Last Updated": "PT0-002 released October 28, 2021 (current as of October 2024)",
        "summary": "The Penetration Testing Professional (PenTest+) certification validates the skills required to identify, exploit, report, and manage vulnerabilities in information systems through penetration testing and vulnerability assessments.",
        "detail description": "PenTest+ is a certification offered by CompTIA that focuses on the practical skills needed for penetration testing and vulnerability management. It covers planning and scoping, information gathering, vulnerability identification, attacks and exploits, post-exploitation, and reporting. It emphasizes hands-on skills and real-world scenarios, making it suitable for cybersecurity professionals involved in penetration testing and vulnerability assessments.",
        "who": "Cybersecurity professionals, penetration testers, vulnerability assessment analysts, security consultants, and IT security managers involved in security testing and vulnerability management.",
        "why": "Obtaining PenTest+ demonstrates proficiency in penetration testing and vulnerability management, enhances career prospects, and validates skills in identifying and mitigating security weaknesses, which is critical for organizations to defend against cyber threats.",
        "requirements": "Recommended: CompTIA Security+ certification or equivalent experience, along with 3-4 years of hands-on information security experience, including penetration testing.",
        "cost": "$392 USD",
        "exam details": "Passing score: 750 (on a scale of 100-900)   Number of questions: 85   Time limit: 165 minutes   Testing provider: Pearson VUE   Registration portal: [CompTIA PenTest+ Exam Registration](https://www.comptia.org/certifications/pentest)",
        "vendor site": "[CompTIA PenTest+ Certification](https://www.comptia.org/certifications/pentest)",
        "vendor": "CompTIA (Computing Technology Industry Association)"
    },
    {
        "Certification": "CISSP-ISSMP",
        "Full name": ": CISSP-ISSMP (Information Systems Security Management Professional)",
        "Exam Number": "ISSMP (CISSP Concentration, ISC2/Pearson VUE)",
        "Last Updated": "Exam outline last updated 1 September 2020 (current as of 2025)",
        "summary": "The Certified Information Systems Security Professional Information Systems Security Management Professional (CISSP-ISSMP) is an advanced certification focusing on security management, leadership, and strategic planning within information security.",
        "detail description": "The CISSP-ISSMP is a specialized concentration exam under the CISSP certification, designed for experienced security professionals who want to demonstrate expertise in security management, policy development, and leadership. It emphasizes strategic security planning, governance, risk management, and program management, complementing the technical knowledge of the core CISSP.",
        "who": "Experienced information security managers, security directors, security consultants, and senior security professionals responsible for security program management and strategic planning.",
        "why": "To validate advanced leadership skills, strategic security management expertise, and the ability to develop and oversee security policies and programs at an organizational level.",
        "requirements": "Hold the (ISC)ï¿½ CISSP certification.   Minimum of five years of cumulative paid work experience in at least two of the eight domains of the (ISC)ï¿½ CISSP Common Body of Knowledge (CBK).   Endorsement by an (ISC)ï¿½ certified professional or a current (ISC)ï¿½ member.",
        "cost": "$599 (subject to change; check official site for current pricing).",
        "exam details": "Passing score: 700 out of 1000 points   Number of questions: 125 multiple-choice and advanced innovative questions   Time limit: 3 hours   Testing provider: Pearson VUE   Registration portal: [ISC)ï¿½ Certification Registration](https://www.isc2.org/Certifications/ISSMP)",
        "vendor site": "[ISC)ï¿½ CISSP-ISSMP Certification](https://www.isc2.org/Certifications/ISSMP)",
        "vendor": "International Information System Security Certification Consortium (ISC)²"
    },
    {
        "Certification": "A+ CE",
        "Full name": ": CompTIA A+ (CE)",
        "Exam Number": "220-1101 (Core 1), 220-1102 (Core 2)",
        "Last Updated": "April 2022 (Core Series 220-1101/220-1102)",
        "summary": "The CompTIA A+ Certification (Continuing Education) is a globally recognized credential that validates foundational skills in information technology support and troubleshooting, with a focus on maintaining and updating knowledge through continuing education.",
        "detail description": "The CompTIA A+ Certification (CE) is an updated version of the foundational IT support certification, emphasizing practical skills in hardware, software, networking, security, and troubleshooting. The CE version requires certified professionals to earn continuing education units (CEUs) to maintain their certification, ensuring their skills stay current with evolving technology.",
        "who": "IT support technicians, help desk specialists, desktop support analysts, and entry-level IT professionals seeking to validate their foundational skills and demonstrate ongoing professional development.",
        "why": "It enhances credibility, improves job prospects, and ensures that professionals stay current with the latest technologies and best practices in IT support.",
        "requirements": "No prerequisites are required to earn the initial A+ certification; however, to maintain the CE certification, holders must earn 20 CEUs every three years through continuing education activities.",
        "cost": "$246 per exam (two exams required for certification).",
        "exam details": "Passing score: 675 out of 900 (per exam)   Number of questions: 90 questions per exam (multiple choice, performance-based)   Time limit: 90 minutes per exam   Testing provider: Pearson VUE   Registration portal: [https://home.pearsonvue.com/comptia](https://home.pearsonvue.com/comptia)",
        "vendor site": "[https://www.comptia.org/certifications/a](https://www.comptia.org/certifications/a)",
        "vendor": "Computing Technology Industry Association (CompTIA)"
    },
    {
        "Certification": "GICSP",
        "Full name": ": GIAC Global Industrial Cyber Security Professional (GICSP)",
        "Exam Number": "GICSP (GIAC exam identifier; no separate numeric exam code)",
        "Last Updated": "August 2024",
        "summary": "The GIAC Certified Industrial Security Professional (GICSP) is a certification designed to validate expertise in securing industrial control systems (ICS), including SCADA, DCS, and other operational technology environments.",
        "detail description": "The GICSP focuses on the security principles, practices, and technologies necessary to protect industrial control systems from cyber threats. It covers topics such as ICS architecture, risk management, security controls, incident response, and compliance specific to industrial environments.",
        "who": "Security professionals, engineers, and IT personnel working in industrial control systems, SCADA, or operational technology environments who want to demonstrate their expertise in securing critical infrastructure.",
        "why": "Obtaining the GICSP certifies that an individual has the specialized knowledge required to identify vulnerabilities and implement security measures in industrial environments, which are increasingly targeted by cyber threats.",
        "requirements": "There are no formal prerequisites, but candidates typically have experience or knowledge in industrial control systems, cybersecurity, or related fields.",
        "cost": "Approximately $1,699 USD",
        "exam details": "Passing score: Not publicly specified; typically around 70-75%     Number of questions: 150 multiple-choice questions     Time limit: 4 hours     Testing provider: Pearson VUE     Registration portal: [GIAC Certification Portal](https://www.giac.org/certification/industrial-security/gicsp/)",
        "vendor site": "[GIAC Certifications SANS Institute](https://www.giac.org/certification/industrial-security/gicsp/)",
        "vendor": "Global Industrial Cyber Security Professional"
    },
    {
        "Certification": "CISM",
        "Full name": ": ISACA Certified Information Security Manager (CISM)",
        "Exam Number": "None (ISACA uses the exam title “CISM Certification Exam,” no numeric code)",
        "Last Updated": "June 1, 2022 (current exam content outline/job practice)"
    },
    {
        "Certification": "CEH",
        "Full name": ": EC-Council Certified Ethical Hacker (CEH)",
        "Exam Number": "312-50 (Pearson VUE and ECC Exam); CEH Practical (performance-based exam; no publicly listed numeric code)",
        "Last Updated": "Version 12 (CEH v12), released September 2022; remains the current version (no newer version announced through 2024)",
        "summary": "The Certified Ethical Hacker (CEH) is a certification that validates an individual's ability to identify and address security vulnerabilities using the same tools and techniques as malicious hackers, but in a lawful and legitimate manner.",
        "detail description": "The CEH certification, offered by the EC-Council (International Council of E-Commerce Consultants), focuses on ethical hacking methodologies, penetration testing, and security assessment techniques. It covers topics such as footprinting, reconnaissance, scanning networks, enumeration, system hacking, malware threats, sniffing, social engineering, denial-of-service attacks, session hijacking, and web application security.",
        "who": "Security professionals, network administrators, security analysts, penetration testers, and IT auditors seeking to demonstrate their skills in identifying vulnerabilities and strengthening organizational security defenses.",
        "why": "Obtaining the CEH certification enhances credibility in the cybersecurity field, demonstrates proficiency in ethical hacking, and helps organizations identify and mitigate security risks proactively.",
        "requirements": "Candidates should have at least two years of work experience in the Information Technology or cybersecurity field. A basic understanding of networking, operating systems, and security concepts is recommended. EC-Council also offers a training program, but it is not mandatory.",
        "cost": "Approximately $1,199 USD (may vary depending on location and testing provider).",
        "exam details": "Passing score: Not publicly specified; typically around 70-85% depending on the exam version   Number of questions: 125 multiple-choice questions   Time limit: 4 hours   Testing provider: Pearson VUE and EC-Councilï¿½s testing platform   Registration portal: [https://cert.eccouncil.org](https://cert.eccouncil.org)",
        "vendor site": "[https://www.eccouncil.org/programs/certified-ethical-hacker-ceh/](https://www.eccouncil.org/programs/certified-ethical-hacker-ceh/)",
        "vendor": "EC-Council (International Council of E-Commerce Consultants)"
    },
    {
        "Certification": "CCNA",
        "Full name": ": Cisco Certified Network Associate (CCNA)",
        "Exam Number": "200-301 CCNA",
        "Last Updated": "September 20, 2023 (Exam Topics v1.1)",
        "summary": "The Cisco Certified Network Associate (CCNA) is an entry-level certification focused on networking fundamentals, including network installation, troubleshooting, and management.",
        "detail description": "The CCNA certification validates a candidateï¿½s ability to install, configure, operate, and troubleshoot small to medium-sized networks. It covers topics such as network fundamentals, IP connectivity, security fundamentals, automation, and programmability.",
        "who": "Network administrators, network engineers, systems administrators, and IT professionals seeking to establish or advance their networking careers.",
        "why": "Obtaining the CCNA demonstrates foundational networking knowledge, enhances employability, and prepares professionals for more advanced Cisco certifications and roles in network management.",
        "requirements": "There are no formal prerequisites; however, foundational knowledge of networking concepts is recommended.",
        "cost": "$300 USD",
        "exam details": "Passing score: Not publicly disclosed (Cisco uses a scaled scoring system)   Number of questions: 100-120 (varies)   Time limit: 120 minutes   Testing provider: Pearson VUE   Registration portal: [Cisco Certification Portal](https://www.cisco.com/c/en/us/training-events/training-certifications/exams.html)",
        "vendor site": "[Cisco CCNA Certification](https://www.cisco.com/c/en/us/training-events/training-certifications/certifications.html)",
        "vendor": "Cisco Systems"
    },
    {
        "Certification": "CAP",
        "Full name": ": ISC2 Certified in Governance, Risk and Compliance (CGRC) — formerly CAP (Certified Authorization Professional)",
        "Exam Number": "CGRC (ISC2 does not use numeric exam codes; register as “ISC2 CGRC” at Pearson VUE). The CAP exam/branding has been retired and replaced by CGRC.",
        "Last Updated": "2023 (rebrand from CAP to CGRC with a new exam outline effective mid-2023)",
        "summary": "The Certified Authorization Professional (CAP) is an advanced certification focused on risk management and security authorization within information systems, aligned with the Risk Management Framework (RMF).",
        "detail description": "The CAP certification validates expertise in managing information system security risk, developing security plans, and authorizing information systems based on federal standards, primarily those outlined by the National Institute of Standards and Technology (NIST). It emphasizes understanding security control frameworks, assessing risks, and implementing security authorization processes.",
        "who": "Information security professionals, risk managers, security analysts, and IT auditors involved in security authorization, risk management, and compliance activities.",
        "why": "Obtaining the CAP demonstrates advanced knowledge and skills in managing security risks and authorizations, supporting compliance with federal standards, and enhancing career prospects in government and regulated sectors.",
        "requirements": "At least two years of professional experience in information security, risk management, or related fields.   A foundational understanding of security controls, risk management, and federal security standards.   No formal prerequisites for the exam, but experience is recommended.",
        "cost": "Approximately $599.",
        "exam details": "Passing score: 700 out of 900   Number of questions: 150 multiple-choice and scenario-based questions   Time limit: 3 hours   Testing provider: Pearson VUE   Registration portal: [ISC)ï¿½ Certification Registration](https://www.isc2.org/Certifications/CAP)",
        "vendor site": "[ISC)ï¿½ Certified Authorization Professional (CAP)](https://www.isc2.org/Certifications/CAP)",
        "vendor": "International Information System Security Certification Consortium (ISC)²"
    }
]